{
    "metadata": {
      "title": "Comprehensive State-by-State Directory of Greywater Laws and Regulations",
      "lastUpdated": "2024-2025",
      "dataSource": "State and federal regulatory agencies",
      "totalStates": 50,
      "summary": "This comprehensive directory reveals a complex patchwork of greywater regulations across the United States, with approximately 30 states having formal greywater policies while 20 states either prohibit such systems or lack specific regulations. Western and Southwestern states lead in progressive greywater frameworks, driven by water scarcity concerns and conservation goals. Arizona pioneered the tiered permit approach allowing systems under 400 gallons per day without permits, while California permits simple washing machine systems without permits for qualifying installations. Eastern and Midwest states generally maintain more restrictive approaches, with states like Illinois and Indiana effectively prohibiting greywater reuse entirely. The regulatory landscape continues evolving rapidly, with Colorado implementing major changes in 2024-2026 shifting to a statewide opt-out system, and several states developing new frameworks as water conservation becomes increasingly critical for sustainable development."
    },
    "states": {
      "Alabama": {
        "legalStatus": "Regulated",
        "governingCode": "Alabama Admin Code r. 335-6-20",
        "permitThresholdGpd": null,
        "permitRequired": "Case-by-case",
        "indoorUseAllowed": false,
        "outdoorUseAllowed": true,
        "approvedUses": ["Limited municipal reclaimed water provisions"],
        "keyRestrictions": ["Purple piping required", "Signage in English/Spanish"],
        "recentChanges": null,
        "primaryAgency": "Alabama Department of Environmental Management",
        "agencyContact": "adem.alabama.gov",
        "agencyPhone": null,
        "governmentWebsite": "https://www.adem.alabama.gov/",
        "regulatoryClassification": "Limited Reclaimed Water Program",
        "summary": "Alabama lacks comprehensive residential greywater regulations, instead operating under limited reclaimed water provisions that primarily address municipal systems. The state's approach focuses on larger-scale water reuse projects rather than individual household greywater systems, requiring purple piping and bilingual signage for any approved systems. Residential greywater applications are evaluated on a case-by-case basis through the Alabama Department of Environmental Management, making the regulatory path unclear for most homeowners seeking water conservation options."
      },
      "Alaska": {
        "legalStatus": "Legal",
        "governingCode": "2018 Uniform Plumbing Code Chapter 16, Alaska Administrative Code Title 8, Chapter 63",
        "permitThresholdGpd": 0,
        "permitRequired": "Yes",
        "indoorUseAllowed": false,
        "outdoorUseAllowed": true,
        "approvedUses": ["Subsurface landscape irrigation for single-family dwellings"],
        "keyRestrictions": ["No kitchen/dishwasher water", "Subsurface distribution only"],
        "recentChanges": "Updated regulations October 1, 2023",
        "primaryAgency": "Alaska Department of Labor and Alaska DEC",
        "agencyContact": "907-269-4925 (Labor), 907-269-7635 (DEC)",
        "agencyPhone": "907-269-4925",
        "governmentWebsite": "https://labor.alaska.gov/lss/forms/Plumbing_Code.pdf",
        "regulatoryClassification": "Comprehensive Regulated",
        "summary": "Alaska maintains a clear regulatory framework for residential greywater systems under the 2018 Uniform Plumbing Code, updated as recently as October 2023. The state permits subsurface greywater irrigation for single-family homes with affordable plumbing permits ranging from $1.50 to $10.00. Systems must exclude kitchen and dishwasher water and use only subsurface distribution methods. Alaska's approach balances environmental protection with practical water conservation needs, particularly important given the state's unique climate and infrastructure challenges in many remote communities."
      },
      "Arizona": {
        "legalStatus": "Legal",
        "governingCode": "Arizona Administrative Code Title 18, Chapter 9, Article 7 (R18-9-701 through R18-9-718)",
        "permitThresholdGpd": 400,
        "permitRequired": "Tiered System",
        "indoorUseAllowed": false,
        "outdoorUseAllowed": true,
        "approvedUses": ["Household gardening", "Composting", "Lawn watering", "Landscape irrigation", "Citrus/nut trees"],
        "keyRestrictions": ["No human contact", "No surface application for food plants", "No spray irrigation"],
        "recentChanges": "25% tax credit up to $1,000 for installation",
        "primaryAgency": "Arizona Department of Environmental Quality",
        "agencyContact": "602-771-2300",
        "agencyPhone": "602-771-2300",
        "governmentWebsite": "https://azdeq.gov/recycled-water",
        "regulatoryClassification": "Progressive Three-Tier System",
        "summary": "Arizona pioneered the most progressive greywater regulations in the United States with its innovative three-tiered permit system that has become a model for other water-scarce states. Type 1 systems under 400 gallons per day require no permits when following 13 best management practices, Type 2 systems (400-3,000 gpd) require general permits, and Type 3 systems over 3,000 gpd need individual permits. The state incentivizes adoption with a 25% tax credit up to $1,000 and allows diverse uses including household gardening, composting, and landscape irrigation, reflecting Arizona's leadership in water conservation driven by chronic water scarcity in the Sonoran Desert."
      },
      "Arkansas": {
        "legalStatus": "Limited/Unclear",
        "governingCode": "Arkansas Administrative Code Agency 007, Division 04, Rule 007.04.93-005",
        "permitThresholdGpd": null,
        "permitRequired": "No specific permits",
        "indoorUseAllowed": false,
        "outdoorUseAllowed": false,
        "approvedUses": ["Must use conventional septic for greywater with composting toilets"],
        "keyRestrictions": ["Must connect to sewer if within 300 feet"],
        "recentChanges": null,
        "primaryAgency": "Arkansas Department of Health",
        "agencyContact": "501-661-2000",
        "agencyPhone": "501-661-2000",
        "governmentWebsite": "https://www.healthy.arkansas.gov/",
        "regulatoryClassification": "Restrictive/No Clear Framework",
        "summary": "Arkansas lacks clear greywater regulations, creating uncertainty for residents interested in water reuse systems. The state's alternative wastewater systems manual suggests greywater can only be used in conjunction with composting toilets and must still flow through conventional septic systems, essentially negating many benefits of greywater reuse. Properties within 300 feet of municipal sewer systems must connect rather than use alternative systems. This regulatory ambiguity leaves Arkansas residents without clear guidance for implementing greywater conservation systems, representing a significant gap in the state's environmental policy framework."
      },
      "California": {
        "legalStatus": "Legal",
        "governingCode": "California Plumbing Code Chapter 15 (Title 24, Part 5)",
        "permitThresholdGpd": null,
        "permitRequired": "Conditional",
        "indoorUseAllowed": true,
        "outdoorUseAllowed": true,
        "approvedUses": ["Subsurface irrigation", "Surface irrigation with mulch cover", "Toilet/urinal flushing"],
        "keyRestrictions": ["No kitchen sink/dishwasher water", "100+ feet from waterways", "Groundwater 3+ feet below"],
        "recentChanges": "Direct Potable Reuse regulations effective October 1, 2024",
        "primaryAgency": "California Building Standards Commission",
        "agencyContact": "916-263-0916, cbsc@dgs.ca.gov",
        "agencyPhone": "916-263-0916",
        "governmentWebsite": "https://www.dgs.ca.gov/BSC",
        "regulatoryClassification": "Progressive Comprehensive Framework",
        "summary": "California operates one of the most comprehensive and user-friendly greywater programs in the nation, allowing simple washing machine systems without permits when meeting 13 specific conditions, while requiring permits for more complex installations. The state permits both indoor reuse (toilet/urinal flushing) and outdoor applications including subsurface irrigation and surface irrigation with mulch cover. Recent regulatory updates include Direct Potable Reuse regulations effective October 2024, demonstrating California's commitment to expanding water recycling capabilities during ongoing drought concerns. The framework balances public health protection with practical water conservation needs across the state's diverse climate zones."
      },
      "Colorado": {
        "legalStatus": "Legal",
        "governingCode": "Regulation 86 (5 CCR 1002-86), House Bill 24-1362",
        "permitThresholdGpd": null,
        "permitRequired": "Local discretion until 2026",
        "indoorUseAllowed": true,
        "outdoorUseAllowed": true,
        "approvedUses": ["Subsurface irrigation", "Toilet/urinal flushing"],
        "keyRestrictions": ["Must comply with water rights laws", "No above-ground sprinklers"],
        "recentChanges": "HB 24-1362 signed May 2024, shifts to opt-out system January 1, 2026",
        "primaryAgency": "Colorado Department of Public Health and Environment",
        "agencyContact": "brandi.honeycutt@state.co.us",
        "agencyPhone": null,
        "governmentWebsite": "https://cdphe.colorado.gov/water-quality/clean-water/reg-86-graywater-control",
        "regulatoryClassification": "Major Regulatory Transition",
        "summary": "Colorado is undergoing a revolutionary shift in greywater policy with House Bill 24-1362, transforming from a local opt-in system to statewide authorization by default starting January 1, 2026. Currently, local governments must actively choose to allow greywater systems, but the new law reverses this to require active opt-out decisions, dramatically expanding access across the state. This change reflects Colorado's recognition of greywater's importance for water conservation in the arid West, though systems must still comply with complex water rights laws that govern Colorado River Basin allocations. The transition represents one of the most significant greywater policy changes in recent U.S. history."
      },
      "Connecticut": {
        "legalStatus": "Legal",
        "governingCode": "Connecticut State Building Code (2012 IPC Chapter 13)",
        "permitThresholdGpd": null,
        "permitRequired": "Yes",
        "indoorUseAllowed": true,
        "outdoorUseAllowed": true,
        "approvedUses": ["Toilet/urinal flushing", "Subsurface landscape irrigation"],
        "keyRestrictions": ["No surface spray", "Must be dyed blue/green", "Separation from groundwater"],
        "recentChanges": null,
        "primaryAgency": "Connecticut Department of Energy and Environmental Protection",
        "agencyContact": "portal.ct.gov/deep",
        "agencyPhone": null,
        "governmentWebsite": "https://portal.ct.gov/deep",
        "regulatoryClassification": "Building Code Framework",
        "summary": "Connecticut regulates greywater systems through its state building code adoption of the 2012 International Plumbing Code Chapter 13, requiring building permits for all installations. The state allows both indoor toilet/urinal flushing and subsurface landscape irrigation, with specific requirements for blue/green dye identification and groundwater separation. While Connecticut's framework is less progressive than Western states, it provides a clear regulatory path for residents seeking water conservation options. The building code approach ensures professional installation standards but may create higher barriers to adoption compared to states with simpler permitting processes."
      },
      "Delaware": {
        "legalStatus": "Regulated",
        "governingCode": "Delaware Administrative Code Title 7, Section 7101",
        "permitThresholdGpd": null,
        "permitRequired": "Yes",
        "indoorUseAllowed": false,
        "outdoorUseAllowed": true,
        "approvedUses": ["Subject to approval for innovative wastewater treatment"],
        "keyRestrictions": ["Cannot pollute public waters or create health hazards"],
        "recentChanges": null,
        "primaryAgency": "Delaware Department of Natural Resources and Environmental Control",
        "agencyContact": "302-739-9948",
        "agencyPhone": "302-739-9948",
        "governmentWebsite": "https://dnrec.delaware.gov/",
        "regulatoryClassification": "Innovative Technology Approval",
        "summary": "Delaware treats greywater systems as innovative wastewater technologies requiring individual department approval rather than operating under standardized permitting processes. This approach allows flexibility for creative water reuse solutions but creates uncertainty for homeowners due to the case-by-case evaluation process. Systems must demonstrate they won't pollute public waters or create health hazards, with approval authority resting with the Delaware Department of Natural Resources and Environmental Control. While this framework theoretically permits greywater use, the lack of clear standards and lengthy approval processes may discourage adoption compared to states with established regulatory pathways."
      },
      "Florida": {
        "legalStatus": "Highly Regulated",
        "governingCode": "Florida Statute 403.892, Florida Plumbing Code Chapter 13",
        "permitThresholdGpd": 0,
        "permitRequired": "Yes",
        "indoorUseAllowed": true,
        "outdoorUseAllowed": false,
        "approvedUses": ["Indoor toilet/urinal flushing only"],
        "keyRestrictions": ["All outdoor irrigation prohibited"],
        "recentChanges": "2021 density bonuses, 2024 tax credits for NSF/ANSI 350 systems",
        "primaryAgency": "Florida Department of Environmental Protection",
        "agencyContact": "850-245-2118",
        "agencyPhone": "850-245-2118",
        "governmentWebsite": "https://floridadep.gov/",
        "regulatoryClassification": "Restrictive Indoor-Only",
        "summary": "Florida maintains one of the most restrictive greywater policies in the United States, prohibiting all outdoor irrigation uses and limiting applications to indoor toilet and urinal flushing only. Despite the state's water challenges and frequent drought conditions, Florida's regulations reflect concerns about public health protection in the humid subtropical climate where pathogen growth risks are elevated. Recent policy updates include 2021 density bonuses for developments with greywater systems and 2024 tax credits for NSF/ANSI 350 certified systems, suggesting some movement toward greater adoption within the constrained indoor-only framework. All systems require permits regardless of size or complexity."
      },
      "Georgia": {
        "legalStatus": "Permitted",
        "governingCode": "Georgia Gray Water Recycling Systems Guidelines (2009)",
        "permitThresholdGpd": null,
        "permitRequired": "Yes",
        "indoorUseAllowed": true,
        "outdoorUseAllowed": true,
        "approvedUses": ["Indoor toilet/urinal flushing", "Subsurface irrigation only"],
        "keyRestrictions": ["Manual collection allowed but automated irrigation restricted", "Turbidity ≤10 NTU"],
        "recentChanges": null,
        "primaryAgency": "Georgia Department of Natural Resources Environmental Protection Division",
        "agencyContact": "epd.georgia.gov",
        "agencyPhone": null,
        "governmentWebsite": "https://epd.georgia.gov/",
        "regulatoryClassification": "Guided Framework with Treatment Standards",
        "summary": "Georgia operates under comprehensive guidelines established in 2009 that permit both indoor and outdoor greywater applications with specific performance standards including turbidity limits of 10 NTU or less. The state allows manual collection systems and simple automated applications but restricts complex irrigation systems, requiring local building department permits for all installations. Georgia's approach balances public health protection with water conservation needs, though the guidelines haven't been substantially updated in over 15 years. The framework permits toilet/urinal flushing and subsurface irrigation while requiring treatment standards that ensure water quality for intended uses."
      },
      "Hawaii": {
        "legalStatus": "Regulated",
        "governingCode": "2009 Guidelines for the Reuse of Gray Water, HRS Chapter 342D-1",
        "permitThresholdGpd": null,
        "permitRequired": "Yes",
        "indoorUseAllowed": false,
        "outdoorUseAllowed": true,
        "approvedUses": ["Residential subsurface landscape irrigation"],
        "keyRestrictions": ["Subsurface only", "No kitchen/dishwasher water"],
        "recentChanges": "First residential condo system approved April 2024",
        "primaryAgency": "Hawaii Department of Health Wastewater Branch",
        "agencyContact": "808-586-4400",
        "agencyPhone": "808-586-4400",
        "governmentWebsite": "https://health.hawaii.gov/",
        "regulatoryClassification": "Comprehensive Guidelines",
        "summary": "Hawaii maintains detailed greywater guidelines that recognize the islands' unique water scarcity challenges and environmental sensitivities, requiring permits for all residential systems through either the Department of Health (non-sewer areas) or county authorities (sewer areas). The state recently achieved a milestone with the first residential condominium greywater system approval in April 2024, demonstrating growing acceptance of water reuse in multi-family settings. Hawaii's regulations focus exclusively on subsurface landscape irrigation, excluding kitchen and dishwasher water, with requirements designed to protect the islands' fragile groundwater and marine ecosystems from contamination."
      },
      "Idaho": {
        "legalStatus": "Legal",
        "governingCode": "Technical Guidance Manual Chapter 4",
        "permitThresholdGpd": null,
        "permitRequired": "Yes",
        "indoorUseAllowed": false,
        "outdoorUseAllowed": true,
        "approvedUses": ["Lawn and landscape irrigation"],
        "keyRestrictions": ["Kitchen sink water excluded"],
        "recentChanges": null,
        "primaryAgency": "Idaho Department of Environmental Quality and Local Health Districts",
        "agencyContact": "208-373-0502",
        "agencyPhone": "208-373-0502",
        "governmentWebsite": "https://www.deq.idaho.gov/",
        "regulatoryClassification": "Local Health Department Framework",
        "summary": "Idaho permits greywater systems through local health district oversight, with permits required for lawn and landscape irrigation systems that exclude kitchen sink water. The state's decentralized approach allows local health districts to adapt requirements to regional conditions, from the arid Snake River Plain to mountain communities with different soil and climate conditions. Idaho's Technical Guidance Manual provides statewide standards while allowing local flexibility, reflecting the state's preference for local control over environmental regulations. This framework works well for rural areas but may create inconsistency across health district boundaries."
      },
      "Illinois": {
        "legalStatus": "Effectively Prohibited",
        "governingCode": "Illinois Administrative Code Title 77, Part 890",
        "permitThresholdGpd": null,
        "permitRequired": "Not Available",
        "indoorUseAllowed": false,
        "outdoorUseAllowed": false,
        "approvedUses": ["None - all greywater must connect to sewer/septic"],
        "keyRestrictions": ["All greywater must be treated as blackwater"],
        "recentChanges": "Proposed plumbing code updates pending",
        "primaryAgency": "Illinois Department of Public Health",
        "agencyContact": "Illinois Department of Public Health",
        "agencyPhone": null,
        "governmentWebsite": "https://dph.illinois.gov/",
        "regulatoryClassification": "Prohibited",
        "summary": "Illinois effectively prohibits residential greywater systems by requiring all wastewater, including greywater, to connect to municipal sewer systems or conventional septic systems. This restrictive approach reflects the state's traditional emphasis on centralized wastewater treatment and conservative public health policies. Despite proposed plumbing code updates being considered, Illinois residents currently have no legal pathway to implement greywater conservation systems. The prohibition is particularly significant given the state's agricultural water demands and periodic drought conditions that could benefit from residential water conservation measures."
      },
      "Indiana": {
        "legalStatus": "Effectively Prohibited",
        "governingCode": "Indiana Administrative Code Title 410",
        "permitThresholdGpd": null,
        "permitRequired": "Not Available",
        "indoorUseAllowed": false,
        "outdoorUseAllowed": false,
        "approvedUses": ["None - all greywater must go to septic systems"],
        "keyRestrictions": ["No standalone greywater systems permitted"],
        "recentChanges": null,
        "primaryAgency": "Indiana Department of Environmental Management",
        "agencyContact": "Indiana Department of Environmental Management",
        "agencyPhone": null,
        "governmentWebsite": "https://www.in.gov/idem/",
        "regulatoryClassification": "Prohibited",
        "summary": "Indiana prohibits standalone greywater systems, requiring all household wastewater including greywater to flow through conventional septic systems or connect to municipal sewer systems. This policy eliminates the water conservation benefits that greywater reuse could provide and reflects Indiana's conservative approach to alternative wastewater management. The prohibition is enforced through the Indiana Department of Environmental Management and applies statewide regardless of local conditions or water scarcity concerns. Indiana residents seeking water conservation must rely on rainwater harvesting and other non-greywater approaches."
      },
      "Iowa": {
        "legalStatus": "No Formal Regulations",
        "governingCode": "Iowa Administrative Code Chapter 567.69",
        "permitThresholdGpd": null,
        "permitRequired": "Not Available",
        "indoorUseAllowed": false,
        "outdoorUseAllowed": false,
        "approvedUses": ["Golf course irrigation only (treated effluent)"],
        "keyRestrictions": ["No residential greywater systems"],
        "recentChanges": null,
        "primaryAgency": "Iowa Department of Natural Resources",
        "agencyContact": "iowadnr.gov",
        "agencyPhone": null,
        "governmentWebsite": "https://www.iowadnr.gov/",
        "regulatoryClassification": "No Policy Framework",
        "summary": "Iowa lacks formal residential greywater regulations, creating a regulatory void that effectively prevents homeowners from implementing greywater conservation systems. The state's water reuse regulations only address treated municipal effluent for applications like golf course irrigation, leaving residential greywater in regulatory limbo. This absence of policy is notable given Iowa's agricultural water demands and increasing interest in water conservation measures. Without clear regulations, Iowa residents cannot legally install greywater systems, and contractors lack guidance for safe installation practices, representing a missed opportunity for water conservation in the nation's heartland."
      },
      "Kansas": {
        "legalStatus": "No Current Formal Regulations",
        "governingCode": "Guidance issued 2014 for subsurface systems under variance",
        "permitThresholdGpd": null,
        "permitRequired": "Local discretion",
        "indoorUseAllowed": false,
        "outdoorUseAllowed": false,
        "approvedUses": ["Limited variance systems"],
        "keyRestrictions": ["Local health department discretion only"],
        "recentChanges": null,
        "primaryAgency": "Kansas Department of Health and Environment",
        "agencyContact": "Kansas Department of Health and Environment",
        "agencyPhone": null,
        "governmentWebsite": "https://www.kdhe.ks.gov/",
        "regulatoryClassification": "Minimal Guidance Only",
        "summary": "Kansas operates with minimal greywater guidance, relying primarily on 2014 guidance for subsurface systems that can only be approved under individual variances at local health department discretion. This approach creates significant uncertainty for residents interested in greywater systems, as approval depends entirely on local officials' interpretation and willingness to approve variance requests. The lack of standardized regulations means inconsistent availability across the state's 105 counties, with some areas potentially open to greywater while others maintain restrictive approaches. Kansas would benefit from comprehensive statewide regulations to provide clarity and consistency for water conservation efforts."
      },
      "Kentucky": {
        "legalStatus": "Comprehensive Regulations",
        "governingCode": "902 KAR 10:085 (updated 2023)",
        "permitThresholdGpd": 55,
        "permitRequired": "Yes",
        "indoorUseAllowed": false,
        "outdoorUseAllowed": true,
        "approvedUses": ["Subsurface absorption/infiltration", "Laundry-only systems"],
        "keyRestrictions": ["55 gallons/day/bedroom", "12-inch separation required"],
        "recentChanges": "Regulations updated 2023",
        "primaryAgency": "Kentucky Energy and Environment Cabinet",
        "agencyContact": "eec.ky.gov",
        "agencyPhone": null,
        "governmentWebsite": "https://eec.ky.gov/",
        "regulatoryClassification": "Comprehensive Regulated Framework",
        "summary": "Kentucky maintains comprehensive greywater regulations updated in 2023 that permit subsurface absorption and infiltration systems based on household size, calculating 55 gallons per day per bedroom with 12-inch separation requirements from groundwater. The state allows specialized laundry-only systems and requires permits through local health departments for all installations. Kentucky's approach reflects careful consideration of the state's varied geology and climate conditions, from mountain regions to river valleys, ensuring systems are appropriate for local soil and groundwater conditions. The recent regulatory updates demonstrate Kentucky's commitment to maintaining current standards while enabling water conservation opportunities."
      },
      "Louisiana": {
        "legalStatus": "No Specific Regulations",
        "governingCode": "Louisiana Revised Statutes Title 30",
        "permitThresholdGpd": null,
        "permitRequired": "Not Available",
        "indoorUseAllowed": false,
        "outdoorUseAllowed": false,
        "approvedUses": ["None specific to greywater"],
        "keyRestrictions": ["No formal greywater policy"],
        "recentChanges": null,
        "primaryAgency": "Louisiana Department of Environmental Quality",
        "agencyContact": "deq.louisiana.gov",
        "agencyPhone": null,
        "governmentWebsite": "https://www.deq.louisiana.gov/",
        "regulatoryClassification": "No Policy Framework",
        "summary": "Louisiana lacks specific greywater regulations, leaving residents without clear legal pathways for implementing water reuse systems despite the state's vulnerability to drought conditions and water supply challenges in many parishes. The state's environmental regulations focus primarily on industrial pollution control and oil and gas activities under Title 30, with minimal attention to residential water conservation technologies. This regulatory gap is particularly significant given Louisiana's coastal location, hurricane impacts on water infrastructure, and growing recognition of water security importance. Louisiana would benefit from developing greywater policies that address both water conservation and the state's unique environmental challenges."
      },
      "Maine": {
        "legalStatus": "Legal",
        "governingCode": "Maine Subsurface Wastewater Disposal Rule (10-144 CMR Ch. 241)",
        "permitThresholdGpd": null,
        "permitRequired": "Yes",
        "indoorUseAllowed": false,
        "outdoorUseAllowed": true,
        "approvedUses": ["Outdoor irrigation with treatment"],
        "keyRestrictions": ["Must include septic tank and leaching system"],
        "recentChanges": null,
        "primaryAgency": "Maine Department of Health and Human Services",
        "agencyContact": "subsurface.wastewater@maine.gov",
        "agencyPhone": null,
        "governmentWebsite": "https://www.maine.gov/dhhs/",
        "regulatoryClassification": "Integrated Wastewater Treatment",
        "summary": "Maine permits greywater systems as part of its comprehensive subsurface wastewater disposal framework, requiring integration with septic tanks and leaching systems rather than allowing standalone greywater applications. This approach ensures treatment standards appropriate for Maine's environmental conditions, including protection of groundwater resources and seasonal soil conditions affected by freeze-thaw cycles. Systems require permits and must be designed by licensed site evaluators, reflecting Maine's emphasis on professional oversight for environmental protection. While more restrictive than some states, Maine's integrated approach provides reliable treatment performance in challenging northern climate conditions."
      },
      "Maryland": {
        "legalStatus": "Legal",
        "governingCode": "Maryland Environment Code § 9-1112 (enacted 2018)",
        "permitThresholdGpd": null,
        "permitRequired": "Pending regulation development",
        "indoorUseAllowed": true,
        "outdoorUseAllowed": true,
        "approvedUses": ["Household gardening", "Composting", "Lawn watering", "Toilet flushing"],
        "keyRestrictions": ["Only from showers, tubs, lavatory sinks", "5-foot groundwater separation"],
        "recentChanges": "2018 authorization law, regulations still being developed",
        "primaryAgency": "Maryland Department of the Environment",
        "agencyContact": "410-537-3000",
        "agencyPhone": "410-537-3000",
        "governmentWebsite": "https://mde.maryland.gov/",
        "regulatoryClassification": "Legislative Framework, Regulations Pending",
        "summary": "Maryland enacted enabling legislation in 2018 authorizing residential greywater systems for household gardening, composting, lawn watering, and toilet flushing, but implementation regulations are still under development by the Maryland Department of the Environment. The law specifies greywater sources limited to showers, bathtubs, and lavatory sinks with 5-foot groundwater separation requirements. This legislative framework represents Maryland's recognition of greywater's water conservation potential, particularly important given Chesapeake Bay watershed protection goals and periodic drought conditions. The delayed regulation development has created uncertainty for residents eager to implement greywater systems under the new legal authority."
      },
      "Massachusetts": {
        "legalStatus": "Legal with Proposed Expansion",
        "governingCode": "Title 5 (310 CMR 15.000), Proposed H.280 and H.774",
        "permitThresholdGpd": null,
        "permitRequired": "Currently requires composting toilets",
        "indoorUseAllowed": false,
        "outdoorUseAllowed": true,
        "approvedUses": ["Limited currently", "Proposed expansion to irrigation and toilet flushing"],
        "keyRestrictions": ["Currently requires composting toilets for greywater use"],
        "recentChanges": "Active legislation in 2024 for major expansion",
        "primaryAgency": "Massachusetts Department of Environmental Protection",
        "agencyContact": "mass.gov/dep",
        "agencyPhone": null,
        "governmentWebsite": "https://www.mass.gov/orgs/department-of-environmental-protection",
        "regulatoryClassification": "Currently Restrictive, Expansion Pending",
        "summary": "Massachusetts currently requires composting toilets for greywater systems under Title 5 regulations, but active 2024 legislation (H.280 and H.774) proposes major expansion to allow irrigation and toilet flushing applications similar to other progressive states. The current restrictive framework reflects Massachusetts' traditionally conservative approach to wastewater management and protection of groundwater resources. Proposed legislation would create a more accessible regulatory framework while maintaining environmental protections, potentially making Massachusetts a leader in Northeast greywater policy. The expansion would be particularly valuable given the state's water supply challenges and environmental justice goals for water access."
      },
      "Michigan": {
        "legalStatus": "Limited Allowance",
        "governingCode": "Michigan Compiled Law 333.12757",
        "permitThresholdGpd": null,
        "permitRequired": "Local health department approval",
        "indoorUseAllowed": false,
        "outdoorUseAllowed": true,
        "approvedUses": ["Case-by-case determination"],
        "keyRestrictions": ["Must be 'acceptable' to local health department"],
        "recentChanges": null,
        "primaryAgency": "Local Health Departments",
        "agencyContact": "Varies by county",
        "agencyPhone": null,
        "governmentWebsite": "https://www.michigan.gov/mdhhs",
        "regulatoryClassification": "Local Discretion Framework",
        "summary": "Michigan allows greywater systems only when deemed 'acceptable' by local health departments, creating a highly variable regulatory landscape across the state's 83 counties where approval depends on local officials' knowledge, policies, and interpretations. This decentralized approach can result in dramatically different outcomes for similar systems depending on location, with some counties embracing greywater while others remain restrictive. The lack of state-level standards or guidance creates uncertainty for residents and contractors, making Michigan's greywater landscape more dependent on local politics and expertise than consistent environmental or public health criteria."
      },
      "Minnesota": {
        "legalStatus": "Limited Guidance",
        "governingCode": "Minnesota Rules 7080.2240",
        "permitThresholdGpd": null,
        "permitRequired": "Case-by-case permits",
        "indoorUseAllowed": false,
        "outdoorUseAllowed": true,
        "approvedUses": ["Irrigation with proper design"],
        "keyRestrictions": ["Tank requirements: 750-1,500+ gallons based on bedrooms"],
        "recentChanges": null,
        "primaryAgency": "Minnesota Pollution Control Agency",
        "agencyContact": "pca.state.mn.us",
        "agencyPhone": null,
        "governmentWebsite": "https://www.pca.state.mn.us/",
        "regulatoryClassification": "Limited Case-by-Case Framework",
        "summary": "Minnesota permits greywater irrigation systems through case-by-case evaluation with substantial tank storage requirements ranging from 750 to over 1,500 gallons based on household size, reflecting the state's cold climate conditions where systems may be inactive during winter months. The Minnesota Pollution Control Agency's approach emphasizes proper system design and storage capacity to handle seasonal variations and ensure treatment effectiveness. While this framework allows greywater use, the large storage requirements and individual permitting process may discourage adoption compared to states with more streamlined approaches, though the requirements are appropriate for Minnesota's climate challenges."
      },
      "Mississippi": {
        "legalStatus": "No Specific Regulations",
        "governingCode": "Mississippi Individual On-site Wastewater Disposal System Law",
        "permitThresholdGpd": null,
        "permitRequired": "Not Available",
        "indoorUseAllowed": false,
        "outdoorUseAllowed": false,
        "approvedUses": ["None specific to greywater"],
        "keyRestrictions": ["No formal greywater policy"],
        "recentChanges": null,
        "primaryAgency": "Mississippi State Department of Health",
        "agencyContact": "601-576-7400",
        "agencyPhone": "601-576-7400",
        "governmentWebsite": "https://msdh.ms.gov/",
        "regulatoryClassification": "No Policy Framework",
        "summary": "Mississippi lacks specific greywater regulations, operating under general onsite wastewater disposal laws that do not address greywater reuse applications, leaving residents without clear legal pathways for water conservation systems. The state's focus on conventional septic systems reflects traditional approaches to wastewater management without consideration of water reuse opportunities. This regulatory gap is significant given Mississippi's rural character, where many residents could benefit from greywater systems for landscape irrigation, and the state's periodic drought conditions that affect both municipal and rural water supplies. Mississippi would benefit from developing greywater policies appropriate for its climate and rural infrastructure needs."
      },
      "Missouri": {
        "legalStatus": "No Formal Regulations",
        "governingCode": "19 CSR 20-3.060, RSMo Chapter 701",
        "permitThresholdGpd": null,
        "permitRequired": "Not Available",
        "indoorUseAllowed": false,
        "outdoorUseAllowed": false,
        "approvedUses": ["All liquid waste must go to sewage tank"],
        "keyRestrictions": ["No standalone greywater systems"],
        "recentChanges": null,
        "primaryAgency": "Missouri Department of Health and Senior Services",
        "agencyContact": "573-751-6095, OWTScourses@health.mo.gov",
        "agencyPhone": "573-751-6095",
        "governmentWebsite": "https://health.mo.gov/",
        "regulatoryClassification": "No Policy Framework",
        "summary": "Missouri explicitly requires all liquid waste including greywater to flow to conventional sewage tanks, effectively prohibiting standalone greywater systems and eliminating water conservation benefits. The state's onsite wastewater treatment system regulations mandate centralized treatment approaches without consideration for water reuse opportunities. This restrictive policy is maintained by the Missouri Department of Health and Senior Services and applies statewide regardless of local water scarcity conditions or conservation goals. Missouri's approach represents one of the more conservative regulatory stances in the Midwest, where water conservation through greywater could provide benefits during periodic drought conditions."
      },
      "Montana": {
        "legalStatus": "Legal",
        "governingCode": "Uniform Plumbing Code 2021 with modifications, House Bill 259 (2007)",
        "permitThresholdGpd": null,
        "permitRequired": "Yes",
        "indoorUseAllowed": true,
        "outdoorUseAllowed": true,
        "approvedUses": ["Landscape irrigation", "Toilet flushing"],
        "keyRestrictions": ["$60 permit fee"],
        "recentChanges": null,
        "primaryAgency": "Montana Department of Labor and Industry Building Codes Bureau",
        "agencyContact": "406-841-2056",
        "agencyPhone": "406-841-2056",
        "governmentWebsite": "https://bsd.dli.mt.gov/",
        "regulatoryClassification": "Comprehensive Legal Framework",
        "summary": "Montana operates under House Bill 259 from 2007 and the 2021 Uniform Plumbing Code, creating a comprehensive legal framework that uniquely includes kitchen sink water in greywater systems, unlike most other states. The state permits both landscape irrigation and toilet flushing with a modest $60 permit fee, making greywater systems accessible to residents across Montana's diverse geography from prairie to mountains. Montana's inclusion of kitchen water reflects practical considerations for rural residents and demonstrates the state's progressive approach to water conservation in an arid climate where every gallon counts for agricultural and domestic use."
      },
      "Nebraska": {
        "legalStatus": "No Formal Regulations",
        "governingCode": "Nebraska Revised Statutes 81-15,237 to 81-15,248",
        "permitThresholdGpd": null,
        "permitRequired": "Not Available",
        "indoorUseAllowed": false,
        "outdoorUseAllowed": false,
        "approvedUses": ["None specific to greywater"],
        "keyRestrictions": ["No formal greywater policy"],
        "recentChanges": null,
        "primaryAgency": "Nebraska Department of Environment and Energy",
        "agencyContact": "dee.nebraska.gov",
        "agencyPhone": null,
        "governmentWebsite": "https://dee.nebraska.gov/",
        "regulatoryClassification": "No Policy Framework",
        "summary": "Nebraska lacks formal greywater regulations despite the state's significant agricultural water demands and periodic drought conditions that could benefit from residential water conservation measures. The state's environmental statutes focus primarily on groundwater protection and municipal water systems without addressing residential greywater reuse opportunities. This regulatory gap leaves Nebraska residents without clear guidance for implementing water conservation systems, representing a missed opportunity in a state where irrigation demands compete with municipal and domestic water needs. Nebraska's agricultural expertise could inform development of greywater policies that balance water conservation with environmental protection."
      },
      "Nevada": {
        "legalStatus": "Limited",
        "governingCode": "NRS Chapter 445A, NAC Chapter 445A",
        "permitThresholdGpd": null,
        "permitRequired": "No specific program",
        "indoorUseAllowed": false,
        "outdoorUseAllowed": false,
        "approvedUses": ["No comprehensive regulations"],
        "keyRestrictions": ["No specific greywater program"],
        "recentChanges": null,
        "primaryAgency": "Nevada Division of Environmental Protection",
        "agencyContact": "775-687-4670",
        "agencyPhone": "775-687-4670",
        "governmentWebsite": "https://ndep.nv.gov/",
        "regulatoryClassification": "Minimal Framework",
        "summary": "Nevada surprisingly lacks comprehensive greywater regulations despite being one of the most arid states in the nation with severe water scarcity challenges, particularly in the Las Vegas metropolitan area dependent on Colorado River allocations. The state's environmental protection laws address general water quality but don't establish specific greywater programs, creating a significant policy gap in a state where water conservation is critical for sustainable development. This absence is particularly notable given neighboring states like Arizona and California have developed progressive greywater frameworks that Nevada could adapt to its desert conditions and urban growth pressures."
      },
      "New Hampshire": {
        "legalStatus": "Legal",
        "governingCode": "New Hampshire State Plumbing Code",
        "permitThresholdGpd": null,
        "permitRequired": "Must meet plumbing standards",
        "indoorUseAllowed": true,
        "outdoorUseAllowed": true,
        "approvedUses": ["Per state plumbing code requirements"],
        "keyRestrictions": ["Must meet state plumbing standards"],
        "recentChanges": null,
        "primaryAgency": "New Hampshire Department of Environmental Services",
        "agencyContact": "des.nh.gov",
        "agencyPhone": null,
        "governmentWebsite": "https://www.des.nh.gov/",
        "regulatoryClassification": "Plumbing Code Framework",
        "summary": "New Hampshire permits greywater systems through its state plumbing code requirements, providing a clear regulatory pathway that ensures professional installation standards while allowing both indoor and outdoor applications. The plumbing code approach reflects New Hampshire's preference for established technical standards rather than separate environmental regulations, ensuring systems meet safety and performance criteria appropriate for the state's climate conditions. This framework provides regulatory clarity for contractors and homeowners while maintaining flexibility for different system types and applications, though it may require professional installation that could increase costs compared to simpler permit-only approaches."
      },
      "New Jersey": {
        "legalStatus": "Regulated with Limitations",
        "governingCode": "N.J.S.A. 58:11-25a",
        "permitThresholdGpd": null,
        "permitRequired": "Local health department approval",
        "indoorUseAllowed": false,
        "outdoorUseAllowed": true,
        "approvedUses": ["Limited to approved alternative systems"],
        "keyRestrictions": ["Local health department discretion"],
        "recentChanges": null,
        "primaryAgency": "Local Health Departments",
        "agencyContact": "Varies by county",
        "agencyPhone": null,
        "governmentWebsite": "https://www.nj.gov/health/",
        "regulatoryClassification": "Local Authority Framework",
        "summary": "New Jersey delegates greywater system approval to local health departments under alternative wastewater treatment provisions, creating a patchwork of policies across the state's 21 counties where availability depends on local interpretation and expertise. This decentralized approach can result in dramatically different outcomes for similar systems depending on location, with some health departments embracing greywater while others maintain restrictive policies. The local authority framework reflects New Jersey's tradition of municipal home rule but creates challenges for residents and contractors seeking consistent statewide guidance, particularly important given the state's high population density and water supply challenges."
      },
      "New Mexico": {
        "legalStatus": "Legal",
        "governingCode": "20.7.3 NMAC Sections 809 and 810",
        "permitThresholdGpd": 250,
        "permitRequired": "Above threshold only",
        "indoorUseAllowed": false,
        "outdoorUseAllowed": true,
        "approvedUses": ["Household gardening", "Composting", "Landscaping"],
        "keyRestrictions": ["5-foot groundwater separation", "Covered storage tanks"],
        "recentChanges": null,
        "primaryAgency": "New Mexico Environment Department",
        "agencyContact": "env.nm.gov",
        "agencyPhone": null,
        "governmentWebsite": "https://www.env.nm.gov/",
        "regulatoryClassification": "Progressive Threshold System",
        "summary": "New Mexico operates a progressive threshold-based system allowing greywater systems under 250 gallons per day without permits while requiring permits for larger systems, reflecting the state's recognition of water conservation importance in the high desert climate. The regulations permit household gardening, composting, and landscaping with practical requirements like 5-foot groundwater separation and covered storage tanks appropriate for New Mexico's arid conditions and intense solar radiation. This framework balances regulatory efficiency with environmental protection, making greywater accessible for typical residential applications while ensuring oversight for larger installations that could impact groundwater resources critical to the state's water security."
      },
      "New York": {
        "legalStatus": "Regulated",
        "governingCode": "Environmental Conservation Law §15-0605, NY Plumbing Code Appendix C",
        "permitThresholdGpd": null,
        "permitRequired": "Yes",
        "indoorUseAllowed": true,
        "outdoorUseAllowed": true,
        "approvedUses": ["Various including irrigation", "Toilet flushing", "Industrial uses"],
        "keyRestrictions": ["Comprehensive standards under development"],
        "recentChanges": "Comprehensive standards under development",
        "primaryAgency": "New York Department of Health and New York DEC",
        "agencyContact": "health.ny.gov, dec.ny.gov",
        "agencyPhone": null,
        "governmentWebsite": "https://www.health.ny.gov/",
        "regulatoryClassification": "Evolving Comprehensive Framework",
        "summary": "New York is developing comprehensive greywater standards under Environmental Conservation Law §15-0605 and the state plumbing code, with current regulations allowing various applications including irrigation, toilet flushing, and even industrial uses while new standards are finalized. The state's dual-agency approach involving both the Department of Health and Department of Environmental Conservation reflects the complexity of balancing public health protection with environmental benefits in the nation's fourth most populous state. New York's evolving framework could significantly influence Northeast regional policy given the state's environmental leadership and the potential for widespread adoption across diverse urban, suburban, and rural communities."
      },
      "North Carolina": {
        "legalStatus": "Regulated and Permitted",
        "governingCode": "38 N.C. Admin Code § 143-355.5, NCPC Chapter 13",
        "permitThresholdGpd": null,
        "permitRequired": "Yes",
        "indoorUseAllowed": true,
        "outdoorUseAllowed": true,
        "approvedUses": ["Outdoor irrigation", "Toilet/urinal flushing with treatment"],
        "keyRestrictions": ["Chlorine ≤4 ppm", "24-hour retention maximum"],
        "recentChanges": null,
        "primaryAgency": "North Carolina DEQ Division of Water Resources",
        "agencyContact": "deq.nc.gov",
        "agencyPhone": null,
        "governmentWebsite": "https://deq.nc.gov/",
        "regulatoryClassification": "Comprehensive Treatment Standards",
        "summary": "North Carolina maintains comprehensive greywater regulations with specific treatment standards including chlorine limits of 4 ppm or less and maximum 24-hour retention requirements, reflecting the state's focus on water quality protection in diverse geographical regions from mountains to coast. The regulations permit both outdoor irrigation and indoor toilet/urinal flushing with appropriate treatment, administered through the DEQ Division of Water Resources with all systems requiring permits. North Carolina's approach balances water conservation opportunities with protection of surface and groundwater resources that are critical for the state's growing population and important ecological systems including the Outer Banks and Appalachian watersheds."
      },
      "North Dakota": {
        "legalStatus": "No Formal Regulations",
        "governingCode": "ND Century Code Title 23.1, Title 61",
        "permitThresholdGpd": null,
        "permitRequired": "Not Available",
        "indoorUseAllowed": false,
        "outdoorUseAllowed": false,
        "approvedUses": ["None specific to greywater"],
        "keyRestrictions": ["No formal greywater policy"],
        "recentChanges": null,
        "primaryAgency": "North Dakota Department of Environmental Quality",
        "agencyContact": "deq.nd.gov",
        "agencyPhone": null,
        "governmentWebsite": "https://deq.nd.gov/",
        "regulatoryClassification": "No Policy Framework",
        "summary": "North Dakota lacks formal greywater regulations despite the state's oil boom driving population growth and increased water demands in areas with limited municipal infrastructure, where greywater systems could provide valuable water conservation and wastewater management solutions. The state's environmental regulations focus primarily on energy industry impacts and agricultural operations without addressing residential water reuse opportunities. This regulatory gap is particularly significant for rural communities and new developments in western North Dakota where conventional wastewater infrastructure may be limited or expensive, representing a missed opportunity for innovative water management approaches."
      },
      "Ohio": {
        "legalStatus": "Legal and Regulated",
        "governingCode": "Ohio Administrative Code 3701-29-17",
        "permitThresholdGpd": 60,
        "permitRequired": "Based on system type",
        "indoorUseAllowed": false,
        "outdoorUseAllowed": true,
        "approvedUses": ["Subsurface irrigation", "Surface with Type 4 treatment"],
        "keyRestrictions": ["Four-tier system: Type 1 (≤60 gpd), Type 2 (60-1,000 gpd), Type 3 (hand-carried), Type 4 (treated)"],
        "recentChanges": null,
        "primaryAgency": "Ohio Department of Health and Local Health Departments",
        "agencyContact": "Ohio Department of Health",
        "agencyPhone": null,
        "governmentWebsite": "https://odh.ohio.gov/",
        "regulatoryClassification": "Most Comprehensive Midwest Framework",
        "summary": "Ohio operates the most comprehensive greywater regulations in the Midwest with an innovative four-tier system that accommodates everything from simple hand-carried systems (Type 3) to sophisticated treated systems allowing surface irrigation (Type 4). The framework includes Type 1 systems under 60 gallons per day and Type 2 systems up to 1,000 gallons per day, providing options for different household sizes and conservation goals. Ohio's detailed approach reflects the state's technical expertise and commitment to both water conservation and public health protection, serving as a model for other Midwest states considering greywater policy development in regions with adequate rainfall but growing interest in sustainable water management practices."
      },
      "Oklahoma": {
        "legalStatus": "Legal",
        "governingCode": "Oklahoma Statutes Title 27A, Section 2-6-108",
        "permitThresholdGpd": 250,
        "permitRequired": "Above threshold only",
        "indoorUseAllowed": false,
        "outdoorUseAllowed": true,
        "approvedUses": ["Household gardening", "Composting", "Landscape irrigation"],
        "keyRestrictions": ["Allows rainwater in greywater systems"],
        "recentChanges": null,
        "primaryAgency": "Oklahoma Department of Environmental Quality",
        "agencyContact": "deq.ok.gov",
        "agencyPhone": null,
        "governmentWebsite": "https://www.deq.ok.gov/",
        "regulatoryClassification": "Progressive Threshold System",
        "summary": "Oklahoma established greywater regulations in 2012 with a 250-gallon-per-day threshold system that includes the unique provision of allowing rainwater to be combined with greywater systems, reflecting innovative thinking about integrated water management approaches. The state permits household gardening, composting, and landscape irrigation without permits for systems below the threshold, administered through the Oklahoma Department of Environmental Quality. Oklahoma's approach demonstrates how oil-producing states can embrace water conservation technologies, particularly important given the state's periodic drought conditions and agricultural water demands that compete with urban and energy sector water needs."
      },
      "Oregon": {
        "legalStatus": "Legal",
        "governingCode": "ORS 454.610, OAR Chapter 340, Division 53",
        "permitThresholdGpd": null,
        "permitRequired": "Yes - three-tier system",
        "indoorUseAllowed": false,
        "outdoorUseAllowed": true,
        "approvedUses": ["Varies by treatment level - subsurface to spray irrigation"],
        "keyRestrictions": ["Annual fees required"],
        "recentChanges": null,
        "primaryAgency": "Oregon Department of Environmental Quality",
        "agencyContact": "503-229-5749",
        "agencyPhone": "503-229-5749",
        "governmentWebsite": "https://www.oregon.gov/deq/",
        "regulatoryClassification": "Three-Tier Permit System",
        "summary": "Oregon operates a comprehensive three-tier permit system that varies applications from subsurface irrigation to spray irrigation based on treatment levels, with all systems requiring permits and annual fees that may discourage adoption compared to neighboring states with simpler approaches. The Oregon Department of Environmental Quality administers the program with detailed technical requirements reflecting the state's commitment to environmental protection and water quality standards. Oregon's approach balances water conservation opportunities with strict environmental oversight appropriate for a state with diverse ecosystems from coastal rainforests to high desert, though the ongoing fee requirements distinguish it from most other states with greywater programs."
      },
      "Pennsylvania": {
        "legalStatus": "Regulated",
        "governingCode": "Title 25, Chapter 73, Section 73.72",
        "permitThresholdGpd": null,
        "permitRequired": "Yes - SEO permit",
        "indoorUseAllowed": false,
        "outdoorUseAllowed": true,
        "approvedUses": ["Must flow to septic tank and absorption area"],
        "keyRestrictions": ["Classification A2014-0018-0002 (February 24, 2014)"],
        "recentChanges": null,
        "primaryAgency": "Pennsylvania Department of Environmental Protection",
        "agencyContact": "717-787-8184",
        "agencyPhone": "717-787-8184",
        "governmentWebsite": "https://www.dep.pa.gov/",
        "regulatoryClassification": "Alternate Onlot Sewage System",
        "summary": "Pennsylvania regulates greywater systems as alternate onlot sewage disposal systems requiring Sewage Enforcement Officer (SEO) permits and integration with septic tanks and absorption areas, effectively treating greywater as conventional wastewater rather than enabling direct reuse benefits. This conservative approach, classified under A2014-0018-0002 since February 2014, reflects Pennsylvania's emphasis on proven wastewater treatment methods and protection of groundwater resources. While the framework provides regulatory certainty, it eliminates many water conservation benefits that standalone greywater systems could provide, representing a missed opportunity for a state with periodic drought conditions and significant agricultural water demands."
      },
      "Rhode Island": {
        "legalStatus": "Limited Information",
        "governingCode": "Private wastewater system regulations",
        "permitThresholdGpd": null,
        "permitRequired": "Unknown",
        "indoorUseAllowed": false,
        "outdoorUseAllowed": false,
        "approvedUses": ["Limited information available"],
        "keyRestrictions": ["Limited information available"],
        "recentChanges": null,
        "primaryAgency": "Rhode Island Department of Health",
        "agencyContact": "health.ri.gov",
        "agencyPhone": null,
        "governmentWebsite": "https://health.ri.gov/",
        "regulatoryClassification": "Unclear Framework",
        "summary": "Rhode Island's greywater regulatory status remains unclear with limited publicly available information about specific policies or procedures, representing a significant information gap for the smallest state where water conservation could provide benefits despite generally adequate rainfall. The Rhode Island Department of Health oversees private wastewater systems but specific greywater provisions are not well documented or publicized. This lack of clarity creates challenges for residents interested in water conservation and suggests Rhode Island could benefit from developing clear greywater policies or at minimum providing better public information about existing regulatory pathways for water reuse systems."
      },
      "South Carolina": {
        "legalStatus": "Limited Regulations",
        "governingCode": "SC Pollution Control Act, Surface Water Withdrawal Act",
        "permitThresholdGpd": null,
        "permitRequired": "Not Available",
        "indoorUseAllowed": false,
        "outdoorUseAllowed": false,
        "approvedUses": ["Generally must go to approved sewer/septic"],
        "keyRestrictions": ["No standalone greywater systems"],
        "recentChanges": null,
        "primaryAgency": "South Carolina Department of Environmental Services",
        "agencyContact": "des.sc.gov",
        "agencyPhone": null,
        "governmentWebsite": "https://des.sc.gov/",
        "regulatoryClassification": "Limited Framework",
        "summary": "South Carolina maintains limited greywater regulations that generally require all wastewater including greywater to flow to approved sewer or septic systems, effectively preventing standalone greywater conservation systems despite the state's periodic drought conditions and growing coastal populations. The state's focus on conventional wastewater treatment reflects traditional approaches to environmental protection without consideration of water reuse opportunities. This restrictive stance is notable given South Carolina's vulnerability to drought impacts on agriculture and municipal water supplies, particularly in rapidly growing areas like Charleston and Greenville where water conservation could provide important benefits."
      },
      "South Dakota": {
        "legalStatus": "No Formal Regulations",
        "governingCode": "ARSD 74:53:01",
        "permitThresholdGpd": null,
        "permitRequired": "Not Available",
        "indoorUseAllowed": false,
        "outdoorUseAllowed": false,
        "approvedUses": ["None specific to greywater"],
        "keyRestrictions": ["No formal greywater policy"],
        "recentChanges": null,
        "primaryAgency": "South Dakota Department of Agriculture and Natural Resources",
        "agencyContact": "danr.sd.gov",
        "agencyPhone": null,
        "governmentWebsite": "https://danr.sd.gov/",
        "regulatoryClassification": "No Policy Framework",
        "summary": "South Dakota lacks formal greywater regulations, leaving residents without clear legal pathways for implementing water conservation systems despite the state's significant agricultural water demands and periodic drought conditions that affect both rural and municipal water supplies. The Department of Agriculture and Natural Resources focuses primarily on agricultural and industrial environmental issues without addressing residential water reuse opportunities. This regulatory gap represents a missed opportunity for a state where water conservation could benefit agricultural communities and rural residents who depend on wells and may face water quality or quantity challenges during dry periods."
      },
      "Tennessee": {
        "legalStatus": "Regulated",
        "governingCode": "Tennessee Plumbing Code Chapter 13",
        "permitThresholdGpd": null,
        "permitRequired": "Yes",
        "indoorUseAllowed": true,
        "outdoorUseAllowed": false,
        "approvedUses": ["Water closet and urinal flushing only"],
        "keyRestrictions": ["Indoor use only"],
        "recentChanges": null,
        "primaryAgency": "Tennessee Department of Environment and Conservation",
        "agencyContact": "tn.gov/environment",
        "agencyPhone": null,
        "governmentWebsite": "https://www.tn.gov/environment/",
        "regulatoryClassification": "Indoor-Only Framework",
        "summary": "Tennessee restricts greywater systems to indoor water closet and urinal flushing only, prohibiting all outdoor irrigation applications despite the state's periodic drought conditions and growing water demands in cities like Nashville and Memphis. This indoor-only approach administered through the Tennessee Plumbing Code reflects conservative public health policies that prioritize pathogen control over water conservation benefits. The restriction is particularly notable given Tennessee's vulnerability to drought impacts on the Tennessee River system and municipal water supplies, representing a missed opportunity for outdoor irrigation that could reduce potable water demands during dry periods while maintaining indoor public health protection."
      },
      "Texas": {
        "legalStatus": "Legal",
        "governingCode": "Texas Health & Safety Code Section 341.039",
        "permitThresholdGpd": 400,
        "permitRequired": "Above threshold only",
        "indoorUseAllowed": true,
        "outdoorUseAllowed": true,
        "approvedUses": ["Irrigation", "Gardening", "Composting", "Landscaping", "Toilet flushing"],
        "keyRestrictions": ["Must overflow to sewer/septic"],
        "recentChanges": null,
        "primaryAgency": "Texas Commission on Environmental Quality",
        "agencyContact": "512-239-1000",
        "agencyPhone": "512-239-1000",
        "governmentWebsite": "https://www.tceq.texas.gov/",
        "regulatoryClassification": "Comprehensive Progressive Framework",
        "summary": "Texas operates one of the most comprehensive and progressive greywater frameworks in the United States, allowing systems under 400 gallons per day without permits for diverse applications including irrigation, gardening, composting, landscaping, and toilet flushing, with the practical requirement that systems overflow to conventional sewer or septic systems. This approach reflects Texas' recognition of water conservation importance given the state's size, diverse climate zones, and periodic severe drought conditions that affect major metropolitan areas and agricultural regions. The Texas Commission on Environmental Quality administers the program with regulations that balance water conservation benefits with public health protection, making Texas a model for other large states developing greywater policies."
      },
      "Utah": {
        "legalStatus": "Legal",
        "governingCode": "Utah Administrative Code R317-401 (revised 2020)",
        "permitThresholdGpd": null,
        "permitRequired": "Yes - tiered fees",
        "indoorUseAllowed": false,
        "outdoorUseAllowed": true,
        "approvedUses": ["Gravity-fed subsurface irrigation", "Multi-family systems"],
        "keyRestrictions": ["Tier 1 ($100 fee), Tier 2 (higher fees)"],
        "recentChanges": "Major update in 2020 from restrictive to user-friendly",
        "primaryAgency": "Utah Department of Environmental Quality Division of Water Quality",
        "agencyContact": "Utah DEQ Division of Water Quality",
        "agencyPhone": null,
        "governmentWebsite": "https://deq.utah.gov/",
        "regulatoryClassification": "Recently Liberalized Framework",
        "summary": "Utah underwent a dramatic regulatory transformation in 2020, shifting from highly restrictive greywater policies to user-friendly regulations that permit gravity-fed subsurface irrigation and multi-family systems with tiered fees starting at $100 for Tier 1 systems. This change reflects Utah's growing recognition of water conservation importance in the arid Intermountain West, where population growth and climate change are straining water resources from the Colorado River and Great Salt Lake systems. The revised regulations administered by the Utah DEQ Division of Water Quality demonstrate how states can successfully modernize greywater policies to balance water conservation goals with environmental protection in challenging desert conditions."
      },
      "Vermont": {
        "legalStatus": "Regulated",
        "governingCode": "Title 10 VSA Chapter 48",
        "permitThresholdGpd": null,
        "permitRequired": "Yes - wastewater system permit",
        "indoorUseAllowed": false,
        "outdoorUseAllowed": true,
        "approvedUses": ["Under wastewater permitting framework"],
        "keyRestrictions": ["Integrated with wastewater permitting"],
        "recentChanges": null,
        "primaryAgency": "Vermont Department of Environmental Conservation",
        "agencyContact": "dec.vermont.gov",
        "agencyPhone": null,
        "governmentWebsite": "https://dec.vermont.gov/",
        "regulatoryClassification": "Wastewater Integration Framework",
        "summary": "Vermont integrates greywater systems within its comprehensive wastewater permitting framework under Title 10 VSA Chapter 48, requiring wastewater system permits for all installations while allowing outdoor applications through the Department of Environmental Conservation. This approach ensures greywater systems meet the same environmental protection standards as other wastewater treatment systems, reflecting Vermont's strong environmental protection tradition and commitment to water quality in a state where tourism and agriculture depend on clean water resources. The integrated framework provides regulatory certainty while maintaining flexibility for innovative water management approaches appropriate for Vermont's rural character and environmental values."
      },
      "Virginia": {
        "legalStatus": "Regulated",
        "governingCode": "Virginia Code § 32.1-248.2, 9VAC25-740, 12VAC5-635",
        "permitThresholdGpd": null,
        "permitRequired": "Yes",
        "indoorUseAllowed": true,
        "outdoorUseAllowed": true,
        "approvedUses": ["Toilets", "Urinals", "Irrigation", "Various non-potable uses"],
        "keyRestrictions": ["VDH permits for greywater, registration for rainwater"],
        "recentChanges": "Rainwater regulations effective November 20, 2024",
        "primaryAgency": "Virginia Department of Health and Virginia DEQ",
        "agencyContact": "804-864-7500 (DOH), 804-698-4000 (DEQ)",
        "agencyPhone": "804-864-7500",
        "governmentWebsite": "https://www.vdh.virginia.gov/",
        "regulatoryClassification": "Comprehensive Framework",
        "summary": "Virginia operates a comprehensive greywater framework under multiple regulations that permit diverse applications including toilets, urinals, irrigation, and various non-potable uses, with Virginia Department of Health permits required for greywater systems and separate registration for rainwater systems. Recent updates include rainwater harvesting regulations effective November 20, 2024, demonstrating Virginia's commitment to expanding water conservation opportunities. The dual-agency approach involving both VDH and Virginia DEQ reflects the complexity of balancing public health protection with water conservation goals in a state with diverse geography from coastal plains to mountains and growing metropolitan areas that face periodic water supply challenges."
      },
      "Washington": {
        "legalStatus": "Legal",
        "governingCode": "RCW Chapter 90.46, WAC Chapter 246-274",
        "permitThresholdGpd": null,
        "permitRequired": "Yes - risk-based tiers",
        "indoorUseAllowed": false,
        "outdoorUseAllowed": true,
        "approvedUses": ["Subsurface irrigation only", "Seasonal use"],
        "keyRestrictions": ["Subsurface only", "Risk-based tiers"],
        "recentChanges": "Developing expanded ONWS rules for 2026",
        "primaryAgency": "Washington Department of Health",
        "agencyContact": "doh.wa.gov",
        "agencyPhone": null,
        "governmentWebsite": "https://doh.wa.gov/",
        "regulatoryClassification": "Risk-Based Tiered System",
        "summary": "Washington operates a risk-based tiered greywater system that permits subsurface irrigation only with seasonal use considerations, administered by the Department of Health under comprehensive regulations that address the state's diverse climate conditions from wet coastal areas to arid eastern regions. The state is developing expanded On-Site Wastewater Treatment Systems (ONWS) rules for 2026, suggesting continued evolution toward more comprehensive water reuse policies. Washington's approach reflects the Pacific Northwest's environmental protection priorities while recognizing water conservation importance, particularly in eastern Washington where irrigation demands and periodic drought conditions create water supply challenges."
      },
      "West Virginia": {
        "legalStatus": "Highly Restricted",
        "governingCode": "West Virginia Code § 64-47-6",
        "permitThresholdGpd": null,
        "permitRequired": "Only with composting toilets",
        "indoorUseAllowed": false,
        "outdoorUseAllowed": true,
        "approvedUses": ["Only with composting toilets and septic system"],
        "keyRestrictions": ["Cannot use greywater system alone", "Requires septic system"],
        "recentChanges": null,
        "primaryAgency": "West Virginia Department of Environmental Protection",
        "agencyContact": "304-926-0440",
        "agencyPhone": "304-926-0440",
        "governmentWebsite": "https://dep.wv.gov/",
        "regulatoryClassification": "Highly Restrictive",
        "summary": "West Virginia maintains one of the most restrictive greywater policies in the United States, requiring composting toilets and conventional septic systems for any greywater use, effectively eliminating the water conservation benefits that standalone greywater systems could provide. This highly conservative approach administered by the West Virginia Department of Environmental Protection reflects traditional wastewater management policies that prioritize proven treatment methods over innovative water conservation approaches. The restrictions are particularly limiting for a rural state where residents could benefit from greywater systems for landscape irrigation, representing a missed opportunity for water conservation in areas that may face well water challenges or periodic drought conditions."
      },
      "Wisconsin": {
        "legalStatus": "Regulated",
        "governingCode": "Chapter SPS 382 and 383",
        "permitThresholdGpd": null,
        "permitRequired": "Yes - POWTS permit",
        "indoorUseAllowed": false,
        "outdoorUseAllowed": true,
        "approvedUses": ["Subsurface and surface irrigation"],
        "keyRestrictions": ["POWTS (Private Onsite Wastewater Treatment Systems) permit required"],
        "recentChanges": null,
        "primaryAgency": "Wisconsin Department of Safety and Professional Services",
        "agencyContact": "dsps.wi.gov",
        "agencyPhone": null,
        "governmentWebsite": "https://dsps.wi.gov/",
        "regulatoryClassification": "POWTS Integration Framework",
        "summary": "Wisconsin integrates greywater systems within its Private Onsite Wastewater Treatment Systems (POWTS) framework under Chapters SPS 382 and 383, requiring POWTS permits for both subsurface and surface irrigation applications administered by the Department of Safety and Professional Services. This approach ensures greywater systems meet established wastewater treatment standards while allowing flexibility for different irrigation methods appropriate for Wisconsin's climate and soil conditions. The POWTS integration reflects Wisconsin's systematic approach to environmental regulation and provides regulatory certainty for contractors and homeowners, though the permit requirements may create barriers compared to states with simpler approval processes."
      },
      "Wyoming": {
        "legalStatus": "Legal",
        "governingCode": "Wyoming Water Quality Rules, Chapter 25, Section 25-17",
        "permitThresholdGpd": 2000,
        "permitRequired": "Notification required",
        "indoorUseAllowed": false,
        "outdoorUseAllowed": true,
        "approvedUses": ["Surface (with disinfection) and subsurface irrigation"],
        "keyRestrictions": ["Maximum 2,000 gallons/day", "Notification to DEQ required"],
        "recentChanges": null,
        "primaryAgency": "Wyoming Department of Environmental Quality",
        "agencyContact": "307-777-7781",
        "agencyPhone": "307-777-7781",
        "governmentWebsite": "https://deq.wyoming.gov/",
        "regulatoryClassification": "Legal by Rule Since 2010",
        "summary": "Wyoming established greywater systems as legal by rule in 2010 with a generous 2,000-gallon-per-day threshold and simple notification requirements to the Department of Environmental Quality, allowing both surface irrigation with disinfection and subsurface irrigation. This progressive approach reflects Wyoming's recognition of water conservation importance in the arid Intermountain West where agricultural, energy, and municipal water demands compete for limited resources. Wyoming's framework demonstrates how sparsely populated states can implement effective greywater policies that balance regulatory efficiency with environmental protection, making water conservation accessible to residents across the state's diverse geography from high plains to mountain valleys."
      }
    }
}